export const anxiety = [
  {
    type: "a",
    text: "Я со страхом думаю о делах, которые мне нужно выполнить.",
  },
  {
    type: "b",
    text: "У меня бывает сухость во рту.",
  },
  {
    type: "c",
    text: "У меня нет смысла жить.",
  },
  {
    type: "d",
    text: "Я нетерпимый(-а) и импульсивный(-а).",
  },
  {
    type: "e",
    text: "Я чувствую себя вялым(-ой).",
  },
  {
    type: "f",
    text: "Я чувствую онемение или покалывания в теле.",
  },
  {
    type: "g",
    text: "Я легко прихожу в замешательство.",
  },
  {
    type: "h",
    text: "Я не могу сосредоточиться на задании, когда знаю, что оно будет строго оцениваться.",
  },
  {
    type: "i",
    text: "У меня не хватает сил вынести все предстоящие трудности.",
  },
  {
    type: "j",
    text: "Я чувствительнее к жизненным невзгодам, чем большинство других людей.",
  },
  {
    type: "k",
    text: "Когда я нервничаю, то сильно потею.",
  },
  {
    type: "l",
    text: "Меня постоянно что-то тревожит.",
  },
  {
    type: "m",
    text: "Я очень боюсь возможных неудач.",
  },
  {
    type: "n",
    text: "В жизни я часто оказываюсь в ситуациях напряжения.",
  },
  {
    type: "o",
    text: "Я хотел бы быть таким же счастливым, как многие люди.",
  },
];

export const efficiency = [
  {
    type: "a",
    text: "Если я как следует постараюсь, то я всегда найду решение даже сложным проблемам.",
  },
  {
    type: "b",
    text: "Если мне что-либо мешает, то я всё же нахожу пути достижения своей цели.",
  },
  {
    type: "c",
    text: "Мне довольно просто удается достичь своих целей.",
  },
  {
    type: "d",
    text: "В неожиданных ситуациях я всегда знаю, как я должен(а) себя вести.",
  },
  {
    type: "e",
    text: "При непредвиденно возникающих трудностях я верю, что смогу с ними справиться.",
  },
  {
    type: "f",
    text: "Если я приложу достаточно усилий, то смогу справиться с большинством проблем.",
  },
  {
    type: "g",
    text: "Я готов(а) к любым трудностям, поскольку полагаюсь на собственные способности.",
  },
  {
    type: "i",
    text: "Я могу что-либо придумать даже в безвыходных на первый взгляд ситуациях.",
  },
  {
    type: "j",
    text: "Я обычно способна держать ситуацию под контролем.",
  },
];
export const adhd = [
  {
    type: "a",
    text: "Я постоянно беспокойно верчусь в кресле.",
  },
  {
    type: "b",
    text: "У меня бывают дни, когда почти все действует мне на нервы.",
  },
  {
    type: "c",
    text: "Я очень легко отвлекаюсь.",
  },
  {
    type: "d",
    text: "Мне сложно регулярно выполнять свои обязанности и/или вовремя оплачивать счета.",
  },
  {
    type: "e",
    text: "Я часто чувствую разочарование и/или недопонимание.",
  },
  {
    type: "f",
    text: "Мне всегда трудно дожидаться своей очереди.",
  },
  {
    type: "g",
    text: "Иногда я слишком много волнуюсь.",
  },
  {
    type: "h",
    text: "Я часто не довожу дело до конца, когда кто-то говорит мне сделать что-то определенным образом.",
  },
  {
    type: "i",
    text: "Я часто переключаюсь с одного занятия на другое.",
  },
  {
    type: "j",
    text: "Я часто теряю такие вещи, как кошелек, ключи, телефон, важные документы и тому подобное.",
  },
  {
    type: "k",
    text: "В детстве у меня были трудности с занятиями, которые требовали навыков координации.",
  },
  {
    type: "l",
    text: "Мне трудно оставаться сосредоточенным(-ой) в течение длительного времени.",
  },
  {
    type: "m",
    text: "Я часто забываю о поручениях и домашних делах.",
  },
];
export const pooh = [
  {
    type: "a",
    text: "Когда я один, мне иногда кажется, что кто-то или что-то за мной наблюдает.",
  },
  {
    type: "b",
    text: "Я склонен(-а) пробираться к потайным уголкам своего подсознания и размышлять на странные темы.",
  },
  {
    type: "c",
    text: "Я не радуюсь, когда со мной случается что-то хорошее. Я чувствую, что я не заслуживаю быть счастливым(-ой).",
  },
  {
    type: "d",
    text: "Я постоянно летаю в облаках.",
  },
  {
    type: "e",
    text: "Когда у меня плохое настроение, я чувствую, будто я тону, пока не достану до самого дна.",
  },
  {
    type: "f",
    text: "Я чувствую себя неуверенно, пока ситуация не находится под моим контролем.",
  },
  {
    type: "g",
    text: "Мне легче принимать серьезные решения, когда другие предложат свой план действий и я могу ему следовать.",
  },
  {
    type: "h",
    text: "Я говорю и думаю быстрее других.",
  },
  {
    type: "i",
    text: "Иногда люди улыбаются мне на улице, и я не понимаю почему.",
  },
  {
    type: "j",
    text: "Сначала работа и домашние обязанности, затем - хобби и развлечения.",
  },
  {
    type: "k",
    text: "Я никогда не замечаю саркастического тона других.",
  },
  {
    type: "l",
    text: "Я всегда стараюсь детально спланировать и организовать свою работу.",
  },
  {
    type: "m",
    text: "Я часто думаю, что общение с другими людьми приносит мне больше отрицательных эмоций, чем положительных.",
  },
];
export const anxietyResults = [
  { id: 1, text: "Поздравляем! У вас низкий уровень тревожности" },
  { id: 2, text: "У вас невысокий уровень тревожности." },
  {
    id: 3,
    text: "У вас средний уровень тревожности. Для более подробной информации обратитесь к специалисту",
  },
  {
    id: 4,
    text: "У вас достаточно высокий уровень тревожности. Для более подробной информации обратитесь к специалисту",
  },
  {
    id: 5,
    text: "У вас высокий уровень тревожности. Для определения точного диагноза обратитесь к специалисту.",
  },
];
export const poohResults = [
  { id: 1, text: "какой-то результат" },
  { id: 2, text: "какой-то результат" },
  {
    id: 3,
    text: "Cмешанный результат. У вас одинаково выражены два или более психотипы, которые характерны для персонажей сказки «Винни-Пух». ",
  },
  {
    id: 4,
    text: "какой-то результат",
  },
  {
    id: 5,
    text: "какой-то результат",
  },
];
export const adhdResults = [
  {
    id: 1,
    text: "Поздравляем! Скорее всего, у вас нет синдрома дефицита внимания и гиперактивности",
  },
  {
    id: 2,
    text: "очень маловероятно, что у вас есть синдром дефицита внимания и гиперактивности",
  },
  {
    id: 3,
    text: "У вас наблюдаются некоторые признаки синдрома дефицита внимания и гиперактивности",
  },
  {
    id: 4,
    text: "У вас может быть синдром дефицита внимания и гиперактивности. Для более подробной информации обратитесь к специалисту",
  },
  {
    id: 5,
    text: "Вероятно, у вас синдром дефицита внимания и гиперактивности. Для определения точного диагноза обратитесь к специалисту.",
  },
];
export const efficiencyResults = [
  { id: 1, text: "У вас низкий уровень само-эффективности" },

  { id: 2, text: "У вас невысокий уровень само-эффективности." },
  {
    id: 3,
    text: "У вас средний уровень само-эффективности.",
  },
  {
    id: 4,
    text: "У вас достаточно высокий уровень само-эффективности.",
  },
  {
    id: 5,
    text: "Поздравляем! У вас высокий уровень само-эффективности.",
  },
];
